# Duplicate Data
- Duplicate data refers to multiple rows (records) in a dataset that are identical or nearly identical

### How To Find Duplicate Data

In [10]:
# Import libraries
import pandas as pd

##### Working on Small Data Set

In [11]:
# Load data (created a small data set fot the practice)
data = {'Name': ['Dev', 'Shivani', 'Aryan','Shivani', 'Dev'], 'Marks_maths': [95, 73, 54, 73, 94], 'Marks_English': [81, 98, 59, 98, 81]}
ds_small = pd.DataFrame(data)
ds_small

      Name  Marks_maths  Marks_English
0      Dev           95             81
1  Shivani           73             98
2    Aryan           54             59
3  Shivani           73             98
4      Dev           94             81

In [3]:
# Check for the duplicate values using duplicated() function
ds_small.duplicated()

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [4]:
# Mark Duplicates Without Removing (usefull for manual review if needed)
ds_small['is_duplicate'] = ds_small.duplicated()  
ds_small  # here this added the new column to the data with values true and false and due to this the data set do not have the duplicate rows

      Name  Marks_maths  Marks_English  is_duplicate
0      Dev           95             81         False
1  Shivani           73             98         False
2    Aryan           54             59         False
3  Shivani           73             98          True
4      Dev           94             81         False

##### Detect Duplicates Based on Specific Columns
- df.duplicated(subset = ['Name' ,'Marks'])
- Here, the duplicate data is not in the one column or something for the entire data if there is a similar complete row in the data then we call it duplicate eg. 3rd row in the above dataset i have created.
- The row with 2,3 columns common in more than 4 or 4 columns then that data is not called to be duplicate eg. 4th row in the dataset as there are 2 columns are common but the third one differs then it is not an part of duplicate data.

In [12]:
# Check the total number of duplicates in the given data
ds_small.duplicated().sum()

np.int64(1)

In [19]:
# Function to remove the duplicate column in the data set [Drop exact duplicates (all columns match)]
ds_small.drop_duplicates(inplace=True)

# Drop Duplicates Based on Subset of Columns ( if i rum the mark duplicate section then can you this at the place of drop-duplicates())
# ds_small_Cleaned = ds_small.drop_duplicates(subset=['Name', 'Marks_maths', 'Marks_English'])

# Drop duplicates but if you want to keep the first duplicate and the last duplicate then use the below parameters in teh drop_duplicates() function
# Keep first occurrence
# ds_small.drop_duplicates(keep='first', inplace=True)
# # Keep last occurrence
# ds_small.drop_duplicates(keep='last', inplace=True)

ds_small  # The dataset with the duplicate values removed and if you want to check it for large data then use df.shape() and check the number of rows and columns

      Name  Marks_maths  Marks_English
0      Dev           95             81
1  Shivani           73             98
2    Aryan           54             59
4      Dev           94             81

### For the Actual Sales_data.csv File

In [22]:
# Load the dataset
ds = pd.read_csv('Sales_data.csv')
ds.head()

,Group,Customer_Segment,Sales_Before,Sales_After,Customer_Satisfaction_Before,Customer_Satisfaction_After,Purchase_Made
0,Control,High Value,240.548359,300.007568,74.684767,NaN,No
1,Treatment,High Value,246.862114,381.337555,100.000000,100.000000,Yes
2,Control,High Value,156.978084,179.330464,98.780735,100.000000,No
3,Control,Medium Value,192.126708,229.278031,49.333766,39.811841,Yes
4,NaN,High Value,229.685623,NaN,83.974852,87.738591,Yes

In [30]:
# Check the duplicate value in the dataset
print(ds.shape)  # to check if the duplicate values get eliminated by checking the number or rows and columns before removing the duplicate values and then after the removal of duplicate value
ds.duplicated().sum()  # there are 0 duplicate value in my datset but usually i have to handle missing values first and then check for the duplicate values in the dataset

(10000, 7)

np.int64(0)

In [ ]:
# Removing the duplicate values
ds.drop_duplicates(inplace=True)
ds.shape

(10000, 7)

: